// 按位异或
// 当对应的二进位相异（不相同）时，结果为1，否则为0
// 规律:
// 相同整数相的结果是0。比如55=0
// 多个整数相^的结果跟顺序无关。例如: 567=576
// 同一个数异或另外一个数两次, 结果还是那个数。例如: 577 = 5

/*
   偶数: 的二进制是以0结尾
   8   -> 1000
   10  -> 1010
   
   奇数: 的二进制是以1结尾
   9   -> 1001
   11  -> 1011

   任何数和1进行&操作,得到这个数的最低位
   1000
  &0001
   -----
   0000  // 结果为0, 代表是偶数

   1011
  &0001
   -----
   0001 // 结果为1, 代表是奇数

*/


/*
  enum Unix {
    S_IRUSR = 256,// 100000000 用户可读
    S_IWUSR = 128,//  10000000 用户可写
    S_IXUSR = 64,//    1000000 用户可执行
    S_IRGRP = 32,//     100000 组可读
    S_IWGRP = 16,//      10000 组可写
    S_IXGRP = 8,//        1000 组可执行
    S_IROTH = 4,//         100 其它可读
    S_IWOTH = 2,//          10 其它可写
    S_IXOTH = 1 //           1 其它可执行
   };
// 假设设置用户权限为可读可写
printf("%d\n", S_IRUSR | S_IWUSR); // 384 // 110000000

*/

/*
 a = a^b;
 b = b^a;
 a = a^b;

*/

//写一个函数把一个10进制数按照二进制格式输出
#include <stdio.h>
void printBinary(int num);
int main() {
    printBinary(13);
}
void printBinary(int num){
    int len = sizeof(int)*8;
    int temp;
    for (int i=0; i<len; i++) {
        temp = num; //每次都在原数的基础上进行移位运算
        temp = temp>>(31-i); //每次移动的位数
        int t = temp&1; //取出最后一位
        if(i!=0&&i%4==0)
            printf(" "); 
        printf("%d",t);
    }
}
