#include <stdio.h>
int main(void) {
    // 定义的同时初始化
    int a0[2][3]={ {80,75,92}, {61,65,71}};

    // 先定义后初始化
    int a[2][3];
    a[0][0] = 80;
    a[0][1] = 75;
    a[0][2] = 92;
    a[1][0] = 61;
    a[1][1] = 65;
    a[1][2] = 71;

    // 按行分段赋值
    int a1[2][3]={ {80,75,92}, {61,65,71}};

    // 按行连续赋值
    int a2[2][3]={80,75,92,61,65,71};

    // 完全初始化,可以省略第一维的长度
    int a3[][3]={{1,2,3},{4,5,6}};
    int a4[][3]={1,2,3,4,5,6};

    //部分初始化,可以省略第一维的长度
    int a5[][3]={{1},{4,5}};
    int a6[][3]={1,2,3,4};

    // 指定元素的初始化
    int a7[2][3]={[1][2]=10};
    int a8[2][3]={[1]={1,2,3}};


}